In [1]:
import requests
import time
import json
import pandas as pd

In [4]:
file_name = "train_spider_200.csv"
file_name_pred = "pred_spider_50.txt"

In [5]:
schema_dict = {'department_management' : """CREATE TABLE IF NOT EXISTS "department" (
"Department_ID" int,
"Name" text,
"Creation" text,
"Ranking" int,
"Budget_in_Billions" real,
"Num_Employees" real,
PRIMARY KEY ("Department_ID")
);

INSERT INTO department VALUES(1,'State','1789','1',9.9600000000000008526,30265.999999999999999);
INSERT INTO department VALUES(2,'Treasury','1789','2',11.099999999999999644,115896.99999999999999);
INSERT INTO department VALUES(3,'Defense','1947','3',439.30000000000001135,3000000.0);


CREATE TABLE IF NOT EXISTS "head" (
"head_ID" int,
"name" text,
"born_state" text,
"age" real,
PRIMARY KEY ("head_ID")
);
                                         

INSERT INTO head VALUES(1,'Tiger Woods','Alabama',66.999999999999999998);
INSERT INTO head VALUES(2,'Sergio García','California',68.000000000000000001);
INSERT INTO head VALUES(3,'K. J. Choi','Alabama',69.0);
                                         
                    
CREATE TABLE IF NOT EXISTS "management" (
"department_ID" int,
"head_ID" int,
"temporary_acting" text,
PRIMARY KEY ("Department_ID","head_ID"),
FOREIGN KEY ("Department_ID") REFERENCES `department`("Department_ID"),
FOREIGN KEY ("head_ID") REFERENCES `head`("head_ID")
);
                                         

INSERT INTO management VALUES(2,5,'Yes');
INSERT INTO management VALUES(15,4,'Yes');
INSERT INTO management VALUES(2,6,'Yes');

""",
               'farm' :"""CREATE TABLE "city" (
"City_ID" int,
"Official_Name" text,
"Status" text,
"Area_km_2" real,
"Population" real,
"Census_Ranking" text,
PRIMARY KEY ("City_ID")
);

CREATE TABLE "farm" (
"Farm_ID" int,
"Year" int,
"Total_Horses" real,
"Working_Horses" real,
"Total_Cattle" real,
"Oxen" real,
"Bulls" real,
"Cows" real,
"Pigs" real,
"Sheep_and_Goats" real,
PRIMARY KEY ("Farm_ID")
);

CREATE TABLE "farm_competition" (
"Competition_ID" int,
"Year" int,
"Theme" text,
"Host_city_ID" int,
"Hosts" text,
PRIMARY KEY ("Competition_ID"),
FOREIGN KEY (`Host_city_ID`) REFERENCES `city`(`City_ID`)
);


CREATE TABLE "competition_record" (
"Competition_ID" int,
"Farm_ID" int,
"Rank" int,
PRIMARY KEY ("Competition_ID","Farm_ID"),
FOREIGN KEY (`Competition_ID`) REFERENCES `farm_competition`(`Competition_ID`),
FOREIGN KEY (`Farm_ID`) REFERENCES `farm`(`Farm_ID`)
);


INSERT INTO  "city" VALUES (1,"Grand Falls/Grand-Sault","Town","18.06","5706","636 of 5008");
INSERT INTO  "city" VALUES (2,"Perth-Andover","Village","8.89","1778","1442 of 5,008");
INSERT INTO  "city" VALUES (3,"Plaster Rock","Village","3.09","1135","1936 of 5,008");


INSERT INTO  "farm" VALUES (1,"1927","5056.5","3900.1","8374.5","805.5","31.6","3852.1","4412.4","7956.3");
INSERT INTO  "farm" VALUES (2,"1928","5486.9","4090.5","8604.8","895.3","32.8","3987.0","6962.9","8112.2");
INSERT INTO  "farm" VALUES (3,"1929","5607.5","4198.8","7611.0","593.7","26.9","3873.0","4161.2","7030.8");


INSERT INTO  "farm_competition" VALUES (1,"2013","Carnival M is back!",1,"Miley Cyrus Jared Leto and Karen Mok");
INSERT INTO  "farm_competition" VALUES (2,"2006","Codehunters",2,"Leehom Wang and Kelly Rowland");
INSERT INTO  "farm_competition" VALUES (3,"2005","MTV Asia Aid",3,"Alicia Keys");


INSERT INTO  "competition_record" VALUES (1,8,1);
INSERT INTO  "competition_record" VALUES (1,2,2);
INSERT INTO  "competition_record" VALUES (1,3,3);""",
               'student_assessment' : """CREATE TABLE Addresses (
address_id INTEGER NOT NULL,
line_1 VARCHAR(80),
line_2 VARCHAR(80),
city VARCHAR(50),
zip_postcode CHAR(20),
state_province_county VARCHAR(50),
country VARCHAR(50),
PRIMARY KEY (address_id)
);

INSERT INTO Addresses (`address_id`, `line_1`, `line_2`, `city`, `zip_postcode`, `state_province_county`, `country`) VALUES (5, '0900 Roderick Oval
New Albina, WA 19200-7914', 'Suite 096', 'Linnealand', '862', 'Montana', 'USA');
INSERT INTO Addresses (`address_id`, `line_1`, `line_2`, `city`, `zip_postcode`, `state_province_county`, `country`) VALUES (9, '966 Dach Ports Apt. 322
Lake Harmonyhaven, VA 65235', 'Apt. 163', 'South Minnie', '716', 'Texas', 'USA');
INSERT INTO Addresses (`address_id`, `line_1`, `line_2`, `city`, `zip_postcode`, `state_province_county`, `country`) VALUES (29, '28550 Broderick Underpass Suite 667
Zakaryhaven, WY 22945-1534', 'Apt. 419', 'North Trystanborough', '112', 'Vermont', 'USA');


CREATE TABLE People (
person_id INTEGER NOT NULL,
first_name VARCHAR(255),
middle_name VARCHAR(255),
last_name VARCHAR(255),
cell_mobile_number VARCHAR(40),
email_address VARCHAR(40),
login_name VARCHAR(40),
password VARCHAR(40),
PRIMARY KEY (person_id)
);
INSERT INTO People (`person_id`, `first_name`, `middle_name`, `last_name`, `cell_mobile_number`, `email_address`, `login_name`, `password`) VALUES (111, 'Shannon', 'Elissa', 'Senger', '01955267735', 'javier.trantow@example.net', 'pgub', '5e4ff49a61b3544da3ad7dc7e2cf28847564c64c');
INSERT INTO People (`person_id`, `first_name`, `middle_name`, `last_name`, `cell_mobile_number`, `email_address`, `login_name`, `password`) VALUES (131, 'Dariana', 'Hayley', 'Bednar', '(262)347-9364x516', 'leila14@example.net', 'zops', 'b20b6a9f24aadeda70d54e410c3219f61fb063fb');
INSERT INTO People (`person_id`, `first_name`, `middle_name`, `last_name`, `cell_mobile_number`, `email_address`, `login_name`, `password`) VALUES (121, 'Virginie', 'Jasmin', 'Hartmann', '(508)319-2970x043', 'boyer.lonie@example.com', 'bkkv', 'b063331ea8116befaa7b84c59c6a22200f5f8caa');


CREATE TABLE Students (
student_id INTEGER NOT NULL,
student_details VARCHAR(255),
PRIMARY KEY (student_id),
FOREIGN KEY (student_id) REFERENCES People (person_id)
);
INSERT INTO Students (`student_id`,`student_details`) VALUES  (111,'Marry');
INSERT INTO Students (`student_id`,`student_details`) VALUES  (121,'Martin');
INSERT INTO Students (`student_id`,`student_details`) VALUES  (131,'Barry');


CREATE TABLE Courses (
course_id VARCHAR(100) NOT NULL,
course_name VARCHAR(120),
course_description VARCHAR(255),
other_details VARCHAR(255),
PRIMARY KEY (course_id)
);
INSERT INTO Courses (`course_id`, `course_name`, `course_description`) VALUES ('301', 'statistics', 'statistics');
INSERT INTO Courses (`course_id`, `course_name`, `course_description`) VALUES ('302', 'English', 'English');
INSERT INTO Courses (`course_id`, `course_name`, `course_description`) VALUES ('303', 'French', 'French');


CREATE TABLE People_Addresses (
person_address_id INTEGER NOT NULL,
person_id INTEGER NOT NULL,
address_id INTEGER NOT NULL,
date_from DATETIME,
date_to DATETIME,
PRIMARY KEY (person_address_id),
FOREIGN KEY (person_id) REFERENCES People (person_id),
FOREIGN KEY (address_id) REFERENCES Addresses (address_id)
);
INSERT INTO People_Addresses (`person_address_id`, `person_id`, `address_id`, `date_from`, `date_to`) VALUES (122, 111, 9, '2012-09-26 13:21:00', '2018-03-21 09:46:30');
INSERT INTO People_Addresses (`person_address_id`, `person_id`, `address_id`, `date_from`, `date_to`) VALUES (257, 121, 5, '2008-07-31 02:17:25', '2018-03-09 02:11:12');
INSERT INTO People_Addresses (`person_address_id`, `person_id`, `address_id`, `date_from`, `date_to`) VALUES (269, 131, 88, '2008-05-26 20:43:41', '2018-03-11 20:26:41');


CREATE TABLE Student_Course_Registrations (
student_id INTEGER NOT NULL,
course_id INTEGER NOT NULL,
registration_date DATETIME NOT NULL,
PRIMARY KEY (student_id, course_id),
FOREIGN KEY (student_id) REFERENCES Students (student_id),
FOREIGN KEY (course_id) REFERENCES Courses (course_id)
);

INSERT INTO Student_Course_Registrations (`student_id`,`course_id`,`registration_date`) VALUES (111,'301','2008-11-04 10:35:13');
INSERT INTO Student_Course_Registrations (`student_id`,`course_id`,`registration_date`) VALUES (121,'301','2008-10-04 10:35:13');
INSERT INTO Student_Course_Registrations (`student_id`,`course_id`,`registration_date`) VALUES (121,'303','2008-11-14 10:35:13');


CREATE TABLE Student_Course_Attendance (
student_id INTEGER NOT NULL,
course_id INTEGER NOT NULL,
date_of_attendance DATETIME NOT NULL,
PRIMARY KEY (student_id, course_id),
FOREIGN KEY (student_id, course_id) REFERENCES Student_Course_Registrations (student_id,course_id)
);

INSERT INTO Student_Course_Attendance (`student_id`,`course_id`,`date_of_attendance`) VALUES (111,'301','2008-11-04 10:35:13');
INSERT INTO Student_Course_Attendance (`student_id`,`course_id`,`date_of_attendance`) VALUES (121,'301','2012-04-09 11:44:34');
INSERT INTO Student_Course_Attendance (`student_id`,`course_id`,`date_of_attendance`) VALUES (121,'303','2014-04-09 11:44:34');


CREATE TABLE Candidates (
candidate_id INTEGER NOT NULL ,
candidate_details VARCHAR(255),
PRIMARY KEY (candidate_id),
FOREIGN KEY (candidate_id) REFERENCES People (person_id)
);
INSERT INTO Candidates (`candidate_id`,`candidate_details`) VALUES  (111,'Jane');
INSERT INTO Candidates (`candidate_id`,`candidate_details`) VALUES  (121,'Robert');
INSERT INTO Candidates (`candidate_id`,`candidate_details`) VALUES  (131,'Alex');


CREATE TABLE Candidate_Assessments (
candidate_id INTEGER NOT NULL,
qualification CHAR(15) NOT NULL,
assessment_date DATETIME NOT NULL,
asessment_outcome_code CHAR(15) NOT NULL,
PRIMARY KEY (candidate_id, qualification),
FOREIGN KEY (candidate_id) REFERENCES Candidates (candidate_id)
);
INSERT INTO Candidate_Assessments (`candidate_id`,`qualification`,`assessment_date`,`asessment_outcome_code`) VALUES (111,'A','2010-04-07 11:44:34','Pass');
INSERT INTO Candidate_Assessments (`candidate_id`,`qualification`,`assessment_date`,`asessment_outcome_code`) VALUES (121,'B','2010-04-17 11:44:34','Pass');
INSERT INTO Candidate_Assessments (`candidate_id`,`qualification`,`assessment_date`,`asessment_outcome_code`) VALUES (131,'D','2010-04-05 11:44:34','Fail');
""",
               'bike_1': """CREATE TABLE station (
    id INTEGER PRIMARY KEY,
    name TEXT,
    lat NUMERIC,
    long NUMERIC,
    dock_count INTEGER,
    city TEXT,
    installation_date TEXT);
INSERT INTO "station" VALUES(2,'San Jose Diridon Caltrain Station',37.329732,-1.21901782000000011405e+02,27,'San Jose','8/6/2013');
INSERT INTO "station" VALUES(3,'San Jose Civic Center',37.330698,-121.888979,15,'San Jose','8/5/2013');
INSERT INTO "station" VALUES(4,'Santa Clara at Almaden',37.333988,-121.894902,11,'San Jose','8/6/2013');


CREATE TABLE status (
    station_id INTEGER,
    bikes_available INTEGER,
    docks_available INTEGER,
    time TEXT,
    FOREIGN KEY (station_id) REFERENCES station(id)
);
INSERT INTO "status" VALUES(3,12,3,'2015-06-02 12:46:02');
INSERT INTO "status" VALUES(3,12,3,'2015-06-02 12:47:02');
INSERT INTO "status" VALUES(3,12,3,'2015-06-02 12:48:02');


CREATE TABLE trip (
    id INTEGER PRIMARY KEY,
    duration INTEGER,
    start_date TEXT,
    start_station_name TEXT, -- this should be removed
    start_station_id INTEGER,
    end_date TEXT,
    end_station_name TEXT, -- this should be removed
    end_station_id INTEGER,
    bike_id INTEGER,
    subscription_type TEXT,
    zip_code INTEGER);
INSERT INTO "trip" VALUES(900504,384,'8/21/2015 17:03','Howard at 2nd',63,'8/21/2015 17:10','San Francisco Caltrain 2 (330 Townsend)',69,454,'Subscriber',94041);
INSERT INTO "trip" VALUES(900505,588,'8/21/2015 17:03','South Van Ness at Market',66,'8/21/2015 17:13','San Francisco Caltrain 2 (330 Townsend)',69,574,'Subscriber',95119);
INSERT INTO "trip" VALUES(900506,196,'8/21/2015 17:04','Market at Sansome',77,'8/21/2015 17:07','Harry Bridges Plaza (Ferry Building)',50,636,'Subscriber',94925);


CREATE TABLE weather (
    date TEXT,
    max_temperature_f INTEGER,
    mean_temperature_f INTEGER,
    min_temperature_f INTEGER,
    max_dew_point_f INTEGER,
    mean_dew_point_f INTEGER,
    min_dew_point_f INTEGER,
    max_humidity INTEGER,
    mean_humidity INTEGER,
    min_humidity INTEGER,
    max_sea_level_pressure_inches NUMERIC,
    mean_sea_level_pressure_inches NUMERIC,
    min_sea_level_pressure_inches NUMERIC,
    max_visibility_miles INTEGER,
    mean_visibility_miles INTEGER,
    min_visibility_miles INTEGER,
    max_wind_Speed_mph INTEGER,
    mean_wind_speed_mph INTEGER,
    max_gust_speed_mph INTEGER,
    precipitation_inches INTEGER,
    cloud_cover INTEGER,
    events TEXT,
    wind_dir_degrees INTEGER,
    zip_code INTEGER);
INSERT INTO "weather" VALUES('8/29/2013',74,68,61,61,58,56,93,75,57,30.07,30.02,29.97,10,10,10,23,11,28,0,4,'',286,94107);
INSERT INTO "weather" VALUES('8/30/2013',78,69,60,61,58,56,90,70,50,30.05,30,29.93,10,10,7,29,13,35,0,2,'',291,94107);
INSERT INTO "weather" VALUES('8/31/2013',71,64,57,57,56,54,93,75,57,30,29.96,29.92,10,10,10,26,15,31,0,4,'',284,94107);
"""}

In [6]:
file_data = pd.read_csv(file_name)

In [7]:
file_data.iloc[12:22]

,question_id,db_id,question
12,12,department_management,What are the distinct ages of the heads who ar...
13,13,department_management,List the states where both the secretary of 'T...
14,14,department_management,Which department has more than 1 head at a tim...
15,15,department_management,Which head's name has the substring 'Ha'? List...
16,16,farm,How many farms are there?
17,17,farm,Count the number of farms.
18,18,farm,List the total number of horses on farms in as...
19,19,farm,"What is the total horses record for each farm,..."
20,20,farm,What are the hosts of competitions whose theme...
21,21,farm,Return the hosts of competitions for which the...

In [8]:
file_data["question"]

0      How many heads of the departments are older th...
1      List the name, born state and age of the heads...
2      List the creation year, name and budget of eac...
3      What are the maximum and minimum budget of the...
4      What is the average number of employees of the...
                             ...
195    Find all the zip codes in which the max dew po...
196    What are all the different zip codes that have...
197    Find the id for the trips that lasted at least...
198    What are the ids of all trips that had a durat...
199    What are the dates in which the mean sea level...
Name: question, Length: 200, dtype: object

In [9]:
def call_llm(data):
    print("in call_llm")
    url = 'https://us-central1-llmsql.cloudfunctions.net/helloWorld'
    response = requests.post(url, data=data)
    print("got response")
    return response

In [10]:
def text_to_sql(schema_all,questions):
    data = {'schema': schema_all,
            'user_in_put': questions}

    # Send a POST request with the data
    print("In text_to_sql going to call_llm")
    response = call_llm(data)
    print("back from call_llm")
    print("going to sleep")
    time.sleep(15)
    print("out of sleep")
    print(questions)
    # Check if the request was successful (status code 200)
    if response.status_code == 200:
        # Print the response content
        res = response.text
        pred_sql = res.partition(":")[2]
        print("res" , response.text)
        return(pred_sql)
    else:
        # If the request was not successful, print the status code
        print(f"Request failed with status code: {response.status_code}")
        pred_sql = text_to_sql(schema_all,questions)
        return pred_sql

In [11]:
file_data = file_data.iloc[:2]

In [12]:
file_data

,question_id,db_id,question
0,0,department_management,How many heads of the departments are older th...
1,1,department_management,"List the name, born state and age of the heads..."

In [13]:

# print("Please type the input")
# user_input = input()
predicted_sql_list = []
for index, row in file_data.iterrows():
# Define the data to be sent in the request body
    sql_predicted = text_to_sql(schema_dict[row["db_id"]],row["question"])
    predicted_sql_list.append(sql_predicted)

In text_to_sql going to call_llm
in call_llm
got response
back from call_llm
going to sleep
out of sleep
How many heads of the departments are older than 56 ?
res {"informationDetermination":"department: Department_ID, head: head_ID, name, age, management: department_ID, head_ID","classificationAndHint":"HINT: [Joins, Aggregate-Query]","sqlGeneration":"SQL Query: SELECT COUNT(*) AS OlderHeadsCount FROM head WHERE age > 56;"}
In text_to_sql going to call_llm
in call_llm
got response
back from call_llm
going to sleep
out of sleep
List the name, born state and age of the heads of departments ordered by age.
res {"informationDetermination":"\"head\": name, born_state, age, \"management\": head_ID, department_ID","classificationAndHint":"HINT: [Joins, Simple-Query, Ordered]","sqlGeneration":"SQL Query: SELECT h.name, h.born_state, h.age FROM head h JOIN management m ON h.head_ID = m.head_ID ORDER BY h.age;"}

In [67]:
len(predicted_sql_list)

4

In [68]:
predicted_sql_list

['"department: Department_ID\\nhead: head_ID, age\\nmanagement: department_ID, head_ID, temporary_acting","classificationAndHint":"HINT: [Aggregate-Query]","sqlGeneration":{"message":"SQL Query: SELECT DISTINCT h.age\\nFROM head h\\nJOIN management m ON h.head_ID = m.head_ID\\nWHERE m.temporary_acting = \'Yes\';","prompt":"\\n    Examples : Consider the example schema and example data \\n    -- Creating the Course table\\n    CREATE TABLE Course (\\n        CourseID INT PRIMARY KEY,\\n        CourseName VARCHAR(255),\\n        Department VARCHAR(100),\\n        Credits INT,\\n        Description TEXT\\n    );\\n    \\n    -- Creating the Professor table\\n    CREATE TABLE Professor (\\n        ProfessorID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Department VARCHAR(100),\\n        Email VARCHAR(255),\\n        OfficeLocation VARCHAR(255)\\n    );\\n    \\n    -- Creating the Student table\\n    CREATE TABLE Student (\\n        StudentID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Email VARCHAR(255),\\n        Major VARCHAR(100),\\n        Year INT\\n    );\\n    \\n    -- Creating the Enrollment table\\n    CREATE TABLE Enrollment (\\n        EnrollmentID INT PRIMARY KEY,\\n        StudentID INT,\\n        CourseID INT,\\n        Semester VARCHAR(50),\\n        Grade VARCHAR(5),\\n        FOREIGN KEY (StudentID) REFERENCES Student(StudentID),\\n        FOREIGN KEY (CourseID) REFERENCES Course(CourseID)\\n    );\\n    \\n    -- Inserting data into Course table\\n    INSERT INTO Course (CourseID, CourseName, Department, Credits, Description) VALUES\\n    (1, \'Introduction to Computer Science\', \'Computer Science\', 4, \'An introductory course on computer science fundamentals.\'),\\n    (2, \'Organic Chemistry\', \'Chemistry\', 4, \'A detailed study of the structure, properties, and reactions of organic compounds.\'),\\n    (3, \'World History\', \'History\', 3, \'A survey of world history from the prehistoric to modern times.\');\\n    \\n    -- Inserting data into Professor table\\n    INSERT INTO Professor (ProfessorID, Name, Department, Email, OfficeLocation) VALUES\\n    (1, \'John Doe\', \'Computer Science\', \'johndoe@university.edu\', \'SciHall Room 401\'),\\n    (2, \'Jane Smith\', \'Chemistry\', \'janesmith@university.edu\', \'ChemBldg Room 302\'),\\n    (3, \'Edward Norton\', \'History\', \'edwardnorton@university.edu\', \'HistHall Room 101\');\\n    \\n    -- Inserting data into Student table\\n    INSERT INTO Student (StudentID, Name, Email, Major, Year) VALUES\\n    (1, \'Alice Johnson\', \'alicejohnson@university.edu\', \'Computer Science\', 2),\\n    (2, \'Bob Lee\', \'boblee@university.edu\', \'Chemistry\', 3),\\n    (3, \'Clara Oswald\', \'claraoswald@university.edu\', \'History\', 1);\\n    \\n    -- Inserting data into Enrollment table\\n    INSERT INTO Enrollment (EnrollmentID, StudentID, CourseID, Semester, Grade) VALUES\\n    (1, 1, 1, \'Fall 2024\', \'A\'),\\n    (2, 2, 2, \'Fall 2024\', \'B\'),\\n    (3, 3, 3, \'Fall 2024\', \'A\');\\n    . And these are example queries .\\n    This is my schema for which I require an SQL Query: CREATE TABLE IF NOT EXISTS \\"department\\" (\\n\\"Department_ID\\" int,\\n\\"Name\\" text,\\n\\"Creation\\" text,\\n\\"Ranking\\" int,\\n\\"Budget_in_Billions\\" real,\\n\\"Num_Employees\\" real,\\nPRIMARY KEY (\\"Department_ID\\")\\n);\\n\\nINSERT INTO department VALUES(1,\'State\',\'1789\',\'1\',9.9600000000000008526,30265.999999999999999);\\nINSERT INTO department VALUES(2,\'Treasury\',\'1789\',\'2\',11.099999999999999644,115896.99999999999999);\\nINSERT INTO department VALUES(3,\'Defense\',\'1947\',\'3\',439.30000000000001135,3000000.0);\\n\\n\\nCREATE TABLE IF NOT EXISTS \\"head\\" (\\n\\"head_ID\\" int,\\n\\"name\\" text,\\n\\"born_state\\" text,\\n\\"age\\" real,\\nPRIMARY KEY (\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO head VALUES(1,\'Tiger Woods\',\'Alabama\',66.999999999999999998);\\nINSERT INTO head VALUES(2,\'Sergio García\',\'California\',68.000000000000000001);\\nINSERT INTO head VALUES(3,\'K. J. Choi\',\'Alabama\',69.0);\\n                                         \\n                    \\nCREATE TABLE IF NOT EXISTS \\"management\\" (\\n\\"department_ID\\" int,\\n\\"head_ID\\" int,\\n\\"temporary_acting\\" text,\\nPRIMARY KEY (\\"Department_ID\\",\\"head_ID\\"),\\nFOREIGN KEY (\\"Department_ID\\") REFERENCES `department`(\\"Department_ID\\"),\\nFOREIGN KEY (\\"head_ID\\") REFERENCES `head`(\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO management VALUES(2,5,\'Yes\');\\nINSERT INTO management VALUES(15,4,\'Yes\');\\nINSERT INTO management VALUES(2,6,\'Yes\');\\n\\n\\n    Columns that maybe relevant in my schema: department: Department_ID\\nhead: head_ID, age\\nmanagement: department_ID, head_ID, temporary_acting,\\n    Hint: You may require HINT: [Aggregate-Query],\\n    Please Generate an SQL query for What are the distinct ages of the heads who are acting?.\\n    Output format should be \\"SQL Query: {Sql Query}\\".\\n    "}}',
 '"department: Name\\nhead: name, born_state\\n\\nThe required columns needed to generate an SQL query for the scenario would be:\\n- From the department table: Name\\n- From the head table: name, born_state","classificationAndHint":"HINT: 3) Nested-Query","sqlGeneration":{"message":"SQL Query: \\nSELECT DISTINCT d1.Name \\nFROM department d1 \\nJOIN management m1 ON d1.Department_ID = m1.department_ID \\nJOIN head h1 ON m1.head_ID = h1.head_ID \\nAND d1.Name = \'Treasury\' \\nJOIN management m2 ON d1.Department_ID = m2.department_ID \\nJOIN head h2 ON m2.head_ID = h2.head_ID \\nAND d2.Name = \'Homeland Security\' \\nWHERE h1.born_state = h2.born_state;","prompt":"\\n    Examples : Consider the example schema and example data \\n    -- Creating the Course table\\n    CREATE TABLE Course (\\n        CourseID INT PRIMARY KEY,\\n        CourseName VARCHAR(255),\\n        Department VARCHAR(100),\\n        Credits INT,\\n        Description TEXT\\n    );\\n    \\n    -- Creating the Professor table\\n    CREATE TABLE Professor (\\n        ProfessorID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Department VARCHAR(100),\\n        Email VARCHAR(255),\\n        OfficeLocation VARCHAR(255)\\n    );\\n    \\n    -- Creating the Student table\\n    CREATE TABLE Student (\\n        StudentID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Email VARCHAR(255),\\n        Major VARCHAR(100),\\n        Year INT\\n    );\\n    \\n    -- Creating the Enrollment table\\n    CREATE TABLE Enrollment (\\n        EnrollmentID INT PRIMARY KEY,\\n        StudentID INT,\\n        CourseID INT,\\n        Semester VARCHAR(50),\\n        Grade VARCHAR(5),\\n        FOREIGN KEY (StudentID) REFERENCES Student(StudentID),\\n        FOREIGN KEY (CourseID) REFERENCES Course(CourseID)\\n    );\\n    \\n    -- Inserting data into Course table\\n    INSERT INTO Course (CourseID, CourseName, Department, Credits, Description) VALUES\\n    (1, \'Introduction to Computer Science\', \'Computer Science\', 4, \'An introductory course on computer science fundamentals.\'),\\n    (2, \'Organic Chemistry\', \'Chemistry\', 4, \'A detailed study of the structure, properties, and reactions of organic compounds.\'),\\n    (3, \'World History\', \'History\', 3, \'A survey of world history from the prehistoric to modern times.\');\\n    \\n    -- Inserting data into Professor table\\n    INSERT INTO Professor (ProfessorID, Name, Department, Email, OfficeLocation) VALUES\\n    (1, \'John Doe\', \'Computer Science\', \'johndoe@university.edu\', \'SciHall Room 401\'),\\n    (2, \'Jane Smith\', \'Chemistry\', \'janesmith@university.edu\', \'ChemBldg Room 302\'),\\n    (3, \'Edward Norton\', \'History\', \'edwardnorton@university.edu\', \'HistHall Room 101\');\\n    \\n    -- Inserting data into Student table\\n    INSERT INTO Student (StudentID, Name, Email, Major, Year) VALUES\\n    (1, \'Alice Johnson\', \'alicejohnson@university.edu\', \'Computer Science\', 2),\\n    (2, \'Bob Lee\', \'boblee@university.edu\', \'Chemistry\', 3),\\n    (3, \'Clara Oswald\', \'claraoswald@university.edu\', \'History\', 1);\\n    \\n    -- Inserting data into Enrollment table\\n    INSERT INTO Enrollment (EnrollmentID, StudentID, CourseID, Semester, Grade) VALUES\\n    (1, 1, 1, \'Fall 2024\', \'A\'),\\n    (2, 2, 2, \'Fall 2024\', \'B\'),\\n    (3, 3, 3, \'Fall 2024\', \'A\');\\n    . And these are example queries .\\n    This is my schema for which I require an SQL Query: CREATE TABLE IF NOT EXISTS \\"department\\" (\\n\\"Department_ID\\" int,\\n\\"Name\\" text,\\n\\"Creation\\" text,\\n\\"Ranking\\" int,\\n\\"Budget_in_Billions\\" real,\\n\\"Num_Employees\\" real,\\nPRIMARY KEY (\\"Department_ID\\")\\n);\\n\\nINSERT INTO department VALUES(1,\'State\',\'1789\',\'1\',9.9600000000000008526,30265.999999999999999);\\nINSERT INTO department VALUES(2,\'Treasury\',\'1789\',\'2\',11.099999999999999644,115896.99999999999999);\\nINSERT INTO department VALUES(3,\'Defense\',\'1947\',\'3\',439.30000000000001135,3000000.0);\\n\\n\\nCREATE TABLE IF NOT EXISTS \\"head\\" (\\n\\"head_ID\\" int,\\n\\"name\\" text,\\n\\"born_state\\" text,\\n\\"age\\" real,\\nPRIMARY KEY (\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO head VALUES(1,\'Tiger Woods\',\'Alabama\',66.999999999999999998);\\nINSERT INTO head VALUES(2,\'Sergio García\',\'California\',68.000000000000000001);\\nINSERT INTO head VALUES(3,\'K. J. Choi\',\'Alabama\',69.0);\\n                                         \\n                    \\nCREATE TABLE IF NOT EXISTS \\"management\\" (\\n\\"department_ID\\" int,\\n\\"head_ID\\" int,\\n\\"temporary_acting\\" text,\\nPRIMARY KEY (\\"Department_ID\\",\\"head_ID\\"),\\nFOREIGN KEY (\\"Department_ID\\") REFERENCES `department`(\\"Department_ID\\"),\\nFOREIGN KEY (\\"head_ID\\") REFERENCES `head`(\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO management VALUES(2,5,\'Yes\');\\nINSERT INTO management VALUES(15,4,\'Yes\');\\nINSERT INTO management VALUES(2,6,\'Yes\');\\n\\n\\n    Columns that maybe relevant in my schema: department: Name\\nhead: name, born_state\\n\\nThe required columns needed to generate an SQL query for the scenario would be:\\n- From the department table: Name\\n- From the head table: name, born_state,\\n    Hint: You may require HINT: 3) Nested-Query,\\n    Please Generate an SQL query for List the states where both the secretary of \'Treasury\' department and the secretary of \'Homeland Security\' were born..\\n    Output format should be \\"SQL Query: {Sql Query}\\".\\n    "}}',
 '"department: Department_ID, Name\\nhead: head_ID, name\\nmanagement: department_ID, head_ID","classificationAndHint":"HINT: [3) Nested-Query]","sqlGeneration":{"message":"SQL Query: \\nSELECT d.Department_ID, d.Name, COUNT(m.head_ID) AS Num_Heads\\nFROM department d\\nJOIN management m ON d.Department_ID = m.department_ID\\nGROUP BY d.Department_ID, d.Name\\nHAVING COUNT(m.head_ID) > 1;","prompt":"\\n    Examples : Consider the example schema and example data \\n    -- Creating the Course table\\n    CREATE TABLE Course (\\n        CourseID INT PRIMARY KEY,\\n        CourseName VARCHAR(255),\\n        Department VARCHAR(100),\\n        Credits INT,\\n        Description TEXT\\n    );\\n    \\n    -- Creating the Professor table\\n    CREATE TABLE Professor (\\n        ProfessorID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Department VARCHAR(100),\\n        Email VARCHAR(255),\\n        OfficeLocation VARCHAR(255)\\n    );\\n    \\n    -- Creating the Student table\\n    CREATE TABLE Student (\\n        StudentID INT PRIMARY KEY,\\n        Name VARCHAR(255),\\n        Email VARCHAR(255),\\n        Major VARCHAR(100),\\n        Year INT\\n    );\\n    \\n    -- Creating the Enrollment table\\n    CREATE TABLE Enrollment (\\n        EnrollmentID INT PRIMARY KEY,\\n        StudentID INT,\\n        CourseID INT,\\n        Semester VARCHAR(50),\\n        Grade VARCHAR(5),\\n        FOREIGN KEY (StudentID) REFERENCES Student(StudentID),\\n        FOREIGN KEY (CourseID) REFERENCES Course(CourseID)\\n    );\\n    \\n    -- Inserting data into Course table\\n    INSERT INTO Course (CourseID, CourseName, Department, Credits, Description) VALUES\\n    (1, \'Introduction to Computer Science\', \'Computer Science\', 4, \'An introductory course on computer science fundamentals.\'),\\n    (2, \'Organic Chemistry\', \'Chemistry\', 4, \'A detailed study of the structure, properties, and reactions of organic compounds.\'),\\n    (3, \'World History\', \'History\', 3, \'A survey of world history from the prehistoric to modern times.\');\\n    \\n    -- Inserting data into Professor table\\n    INSERT INTO Professor (ProfessorID, Name, Department, Email, OfficeLocation) VALUES\\n    (1, \'John Doe\', \'Computer Science\', \'johndoe@university.edu\', \'SciHall Room 401\'),\\n    (2, \'Jane Smith\', \'Chemistry\', \'janesmith@university.edu\', \'ChemBldg Room 302\'),\\n    (3, \'Edward Norton\', \'History\', \'edwardnorton@university.edu\', \'HistHall Room 101\');\\n    \\n    -- Inserting data into Student table\\n    INSERT INTO Student (StudentID, Name, Email, Major, Year) VALUES\\n    (1, \'Alice Johnson\', \'alicejohnson@university.edu\', \'Computer Science\', 2),\\n    (2, \'Bob Lee\', \'boblee@university.edu\', \'Chemistry\', 3),\\n    (3, \'Clara Oswald\', \'claraoswald@university.edu\', \'History\', 1);\\n    \\n    -- Inserting data into Enrollment table\\n    INSERT INTO Enrollment (EnrollmentID, StudentID, CourseID, Semester, Grade) VALUES\\n    (1, 1, 1, \'Fall 2024\', \'A\'),\\n    (2, 2, 2, \'Fall 2024\', \'B\'),\\n    (3, 3, 3, \'Fall 2024\', \'A\');\\n    . And these are example queries .\\n    This is my schema for which I require an SQL Query: CREATE TABLE IF NOT EXISTS \\"department\\" (\\n\\"Department_ID\\" int,\\n\\"Name\\" text,\\n\\"Creation\\" text,\\n\\"Ranking\\" int,\\n\\"Budget_in_Billions\\" real,\\n\\"Num_Employees\\" real,\\nPRIMARY KEY (\\"Department_ID\\")\\n);\\n\\nINSERT INTO department VALUES(1,\'State\',\'1789\',\'1\',9.9600000000000008526,30265.999999999999999);\\nINSERT INTO department VALUES(2,\'Treasury\',\'1789\',\'2\',11.099999999999999644,115896.99999999999999);\\nINSERT INTO department VALUES(3,\'Defense\',\'1947\',\'3\',439.30000000000001135,3000000.0);\\n\\n\\nCREATE TABLE IF NOT EXISTS \\"head\\" (\\n\\"head_ID\\" int,\\n\\"name\\" text,\\n\\"born_state\\" text,\\n\\"age\\" real,\\nPRIMARY KEY (\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO head VALUES(1,\'Tiger Woods\',\'Alabama\',66.999999999999999998);\\nINSERT INTO head VALUES(2,\'Sergio García\',\'California\',68.000000000000000001);\\nINSERT INTO head VALUES(3,\'K. J. Choi\',\'Alabama\',69.0);\\n                                         \\n                    \\nCREATE TABLE IF NOT EXISTS \\"management\\" (\\n\\"department_ID\\" int,\\n\\"head_ID\\" int,\\n\\"temporary_acting\\" text,\\nPRIMARY KEY (\\"Department_ID\\",\\"head_ID\\"),\\nFOREIGN KEY (\\"Department_ID\\") REFERENCES `department`(\\"Department_ID\\"),\\nFOREIGN KEY (\\"head_ID\\") REFERENCES `head`(\\"head_ID\\")\\n);\\n                                         \\n\\nINSERT INTO management VALUES(2,5,\'Yes\');\\nINSERT INTO management VALUES(15,4,\'Yes\');\\nINSERT INTO management VALUES(2,6,\'Yes\');\\n\\n\\n    Columns that maybe relevant in my schema: department: Department_ID, Name\\nhead: head_ID, name\\nmanagement: department_ID, head_ID,\\n    Hint: You may require HINT: [3) Nested-Query],\\n    Please Generate an SQL query for Which department has more than 1 head at a time? List the id, name and the number of heads..\\n    Output format should be \\"SQL Query: {Sql Query}\\".\\n    "}}',

In [69]:
def write_list_to_file(lst, filename):
    with open(filename, 'w') as file:
        for item in lst:
            if item is not None:
                test_str = item.replace("\\n", " ")  # Replace newline characters with spaces
                sub1 = "SQL Query:"
                sub2 = "prompt"
                # getting index of substrings
                idx1 = test_str.index(sub1)
                idx2 = test_str.index(sub2)
                res = ''
                # getting elements in between
                for idx in range(idx1 + len(sub1) + 1, idx2):
                    res = res + test_str[idx]
                res = res.strip()
                file.write(str(res[:-3]) + '\n')
            else:
                file.write("None\n")  # Write "None" to file if item is None

In [70]:
write_list_to_file(predicted_sql_list, "12_to_22_1st4.txt")

In [31]:
test_str = predicted_sql_list[1].replace("\\n", " ")
sub1 = "SQL Query:"
sub2 = "prompt"
# getting index of substrings
idx1 = test_str.index(sub1)
idx2 = test_str.index(sub2)
 
res = ''
# getting elements in between
for idx in range(idx1 + len(sub1) + 1, idx2):
    res = res + test_str[idx]

In [32]:
res.strip()

'SELECT h.name, h.born_state, h.age FROM head h JOIN management m ON h.head_ID = m.head_ID ORDER BY h.age;","'

In [20]:
res.replace("\\n", " ")[1:-3]

'SELECT COUNT(*)  FROM head  WHERE age > 56;'

In [ ]:
python evaluation.py --gold '/home/dgreen/sem2/bigdata/finalproject/gold_example.txt' --pred '/home/dgreen/sem2/bigdata/finalproject/pred_example.txt' --etype 'all' --db '/home/dgreen/sem2/bigdata/finalproject/database' --table '/home/dgreen/sem2/bigdata/finalproject/tables.json'

In [71]:
import json
import csv

def convert_json_to_csv(json_file, csv_file):
    # Open the JSON file and load the data
    with open(json_file, 'r') as json_file:
        data = json.load(json_file)

    # Open the CSV file and create a CSV writer object
    with open(csv_file, 'w', newline='') as csv_file:
        writer = csv.writer(csv_file)

        # Write the header using keys from the first object in the JSON data
        writer.writerow(data[0].keys())

        # Write the data
        for item in data:
            writer.writerow(item.values())

# Example usage
json_file = 'train_spider.json'
csv_file = 'train_spider_8k.csv'
convert_json_to_csv(json_file, csv_file)

In [72]:
import pandas as pd
data_200 = pd.read_csv("train_spider_8k.csv")

In [73]:
data_200_need = data_200[['db_id','question']]

In [74]:
data_200_need.to_csv("train_spider_8k_short.csv")

In [76]:
len(data_200['db_id'].unique())

140

In [1]:
def sort_file_by_number(filename):
    with open(filename, 'r') as file:
        lines = file.readlines()

    # Initialize a list to hold lines with valid numeric prefixes
    valid_lines = []

    # Process each line to extract the number and handle cases where it fails
    for line in lines:
        parts = line.split()
        if parts:  # Check if line is not empty
            try:
                # Attempt to convert the first part to an integer
                number = int(parts[0])
                valid_lines.append((number, line))
            except ValueError:
                # Skip lines where conversion fails
                continue

    # Sort the lines based on the extracted number
    valid_lines.sort()

    # Write the sorted lines back to a file, extracting just the line part of the tuple
    with open('sorted_output.txt', 'w') as file:
        for _, line in valid_lines:
            file.write(line)

# Replace 'input_file.txt' with the path to your file
sort_file_by_number('finalProj65Merge.txt')

In [7]:
def sort_file_by_number(filename):
    with open(filename, 'r') as file:
        lines = file.readlines()

    # Initialize a list to hold lines with valid numeric prefixes
    valid_lines = []

    # Process each line to extract the number and handle cases where it fails
    for line in lines:

        parts = line.split()
        if parts:  # Check if line is not empty
            try:
                # Attempt to convert the first part to an integer
                number = int(parts[0])
                valid_lines.append((number, line))
            except ValueError:
                # Skip lines where conversion fails
                continue

    # Sort the lines based on the extracted number
    valid_lines.sort()

    # Write the sorted lines back to a file, extracting just the line part of the tuple
    with open('finalProj65Merge_sorted_output.txt', 'w') as file:
        for _, line in valid_lines:
            
            file.write(line)

# Replace 'input_file.txt' with the path to your file
sort_file_by_number('finalProj65Merge.txt')

In [9]:
proper_lines = []
with open("finalProj65Merge_sorted_output.txt", 'r') as file:
        lines = file.readlines()
        for line in lines:
                if "```sql" in line:
                        sub1 = "```sql"
                        sub2 = "```"
                        idx1 = line.index(sub1)
                        idx2 = line.index(sub2)
                        
                        res = ''
                        # getting elements in between
                        for idx in range(idx1 + len(sub1) + 1, idx2):
                                res = res + line[idx]
                        line = res
                elif "```" in line:
                        sub1 = "```"
                        sub2 = "```"
                        idx1 = line.index(sub1)
                        idx2 = line.index(sub2)
                        
                        res = ''
                        # getting elements in between
                        for idx in range(idx1 + len(sub1) + 1, idx2):
                                res = res + line[idx]
                        line = res
                elif "Query:" in line:
                        sub1 = "Query:"
                        sub2 = "```"
                        idx1 = line.index(sub1)
                        idx2 = line.index(sub2)
                        
                        res = ''
                        # getting elements in between
                        for idx in range(idx1 + len(sub1) + 1, idx2):
                                res = res + line[idx]
                        line = res
                proper_lines.append(line)

with open('finalProj65Merge_sorted_output_2.txt', 'w') as file:
        for line in proper_lines:
            file.write(line)

In [10]:
with open("finalProj65Merge.txt", 'r') as file:
    lines = file.readlines()

In [13]:
valid_lines = []
lines[1].split()
number = int(lines[1].split()[0])
valid_lines.append((number, line[1]))

In [14]:
valid_lines

[(10, '9')]

In [ ]:
python3 evaluation.py --gold '/home/dgreen/sem2/bigdata/finalproject/extracted_query_dbid_golden.txt' --pred '/home/dgreen/sem2/bigdata/finalproject/Processed_finalProj65Merge_sorted_output.txt' --etype 'all' --db '/home/dgreen/sem2/bigdata/finalproject/database' --table '/home/dgreen/sem2/bigdata/finalproject/tables.json'